lahirunirmalx/Phoebe/platforms/esp32_idf_test/sdkconfig.defaults
# Test platform: WROOM-32D (classic ESP32 Xtensa LX6, 4 MB flash) +
# SSD1306 128x64 I2C OLED. Forked from platforms/esp32_idf/sdkconfig.defaults
# with the target / flash size / console adjusted.
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Arduino-as-component: keep Network on so WiFi.h / HTTPClient.h compile.
CONFIG_ARDUINO_SELECTIVE_COMPILATION=y
CONFIG_ARDUINO_SELECTIVE_EEPROM=n
CONFIG_ARDUINO_SELECTIVE_Preferences=n
CONFIG_ARDUINO_SELECTIVE_Ticker=n
CONFIG_ARDUINO_SELECTIVE_SD=n
CONFIG_ARDUINO_SELECTIVE_SD_MMC=n
CONFIG_ARDUINO_SELECTIVE_SPIFFS=n
CONFIG_ARDUINO_SELECTIVE_FFat=n
CONFIG_ARDUINO_SELECTIVE_LittleFS=n
CONFIG_ARDUINO_SELECTIVE_Network=y
CONFIG_ARDUINO_SELECTIVE_Ethernet=n
CONFIG_ARDUINO_SELECTIVE_PPP=n
CONFIG_ARDUINO_SELECTIVE_BluetoothSerial=n

CONFIG_BT_ENABLED=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=9000

# Classic ESP32 uses UART console (no USB-JTAG like c6/s3/c3).
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# Disable brownout detector -- USB power into the WROOM-32D dev module
# regularly dips below the 2.43 V default threshold during WiFi PHY init,
# triggering a hard reset before the app gets anywhere.
CONFIG_ESP_BROWNOUT_DET=n

CONFIG_ESP_TASK_WDT_EN=n
CONFIG_ESP_WIFI_DYNAMIC_RX_MGMT_BUFFER=y
CONFIG_ESP_WIFI_GMAC_SUPPORT=n
CONFIG_FREERTOS_HZ=1000
CONFIG_LWIP_HOOK_IP6_INPUT_NONE=y
CONFIG_MBEDTLS_ECP_RESTARTABLE=y
CONFIG_MBEDTLS_ECP_FIXED_POINT_OPTIM=y
# arduino-esp32 v2's WiFiClientSecure / ssl_client.cpp body is guarded by
# MBEDTLS_KEY_EXCHANGE_SOME_PSK_ENABLED; without it the symbols vanish at
# link time even though we don't call HTTPS.
CONFIG_MBEDTLS_PSK_MODES=y
CONFIG_MBEDTLS_KEY_EXCHANGE_PSK=y
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_DEF_REFR_PERIOD=16
CONFIG_LV_USE_THEME_MONO=y
CONFIG_LV_BUILD_EXAMPLES=n
# AppClaudeMeter and the watch faces reference both 14 and 24 px Montserrat.
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_FMB_TCP_UID_ENABLED=y
# std::thread for AppClaudeMeter's fetch loop runs HTTPClient + JSON parse;
# 3 KB default isn't enough.
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=8192
